OpenFOAM-7/tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication $application

if ! isTest $@
then
    foamDictionary system/controlDict -entry endTime -set 4
    foamDictionary system/controlDict -entry startTime -set 0.5
    foamDictionary 0.5/T.liquid -entry boundaryField.wall2.q -set 'uniform 500000'
    foamDictionary 0.5/T.liquid -entry boundaryField.wall1.q -set 'uniform 500000'
    foamDictionary 0.5/U.liquid -entry boundaryField.inlet.type -set 'fixedValue'
    runApplication -a $application
fi

#------------------------------------------------------------------------------
